Re-organize architecture docs
